start_phrase = """🎉 Добро пожаловать на RUTUBE!

Познакомьтесь с нашим новым умным помощником — он здесь, чтобы сделать ваше общение с сервисом проще и быстрее. Больше никаких долгих ожиданий ответа от службы поддержки — теперь всё решается за пару кликов!

Что умеет наш помощник:
1. 🚀 Сообщить о проблеме — просто отправьте свой вопрос, и бот подберёт ответ из базы знаний.
2. 📚 FAQ — найдите ответы на популярные вопросы и узнайте, как использовать нашего помощника по максимуму.

Выбирайте нужную кнопку и получайте решения мгновенно. Мы всегда рядом, чтобы помочь! 😊"""

help_text = """Здесь типа полезный текст"""

problem_answer = """Пожалуйста, опишите свою проблему как можно подробнее, чтобы мы могли Вам помочь.

Вы можете использовать голосовое сообщение, агент распознает текст и сможет ответить на ваше обращение."""

faq_answer = """Здесь Вы найдете ответы на часто задаваемые вопросы.
Если Вы не найдете ответ на свой вопрос, всегда можете обратиться к нам напрямую, нажав кнопку "Сообщить о проблеме"."""

problem_response_answer = (
    """Ваше обращение принято в нашу систему. В ближайшее время агент ответит Вам.

Среднее время ответа помощника ~ 1-2 минуты."""
)

back_start_answer = """Спасибо за обращение!"""

restart_problem_answer = """Попробуйте задать вопрос ещё раз!"""

did_not_understand_answer = (
    """Не понял о чем Вы сказали, пожалуйста, следуйте инструкциям!"""
)
