start_phrase = """🌟 Добро пожаловать 🌟

Это «Интеллектуальный помощник оператора службы поддержки» видеосервиса Rutube от команды Invexion. Мы рады Вам помочь 😊

У Вас есть вопрос или проблема? Выберите один из следующих вариантов:

1. **Сообщить о проблеме** - если у вас возникла конкретная проблема, которую вы хотите решить.
2. **FAQ** - если вы хотите найти ответы на часто задаваемые вопросы.

Нажмите на соответствующую кнопку, чтобы продолжить. 👉

🔗 Если у вас есть другие вопросы или вам нужна дополнительная помощь, не стесняйтесь обращаться к нам 😊"""

help_text = """
🤖 **Привет** Это интеллектуальный помощник оператора службы поддержки видеохостинга RUTUBE.

📚 **О сервисе:**
RUTUBE - это популярный видеохостинг, на котором ты можешь загружать, просматривать и делиться видеоконтентом. Наш сервис предназначен для того, чтобы сделать ваше взаимодействие с видео максимально удобным и приятным.

🔍 **Что может этот бот?**
- **Отвечать на часто задаваемые вопросы:** Бот знает ответы на самые распространенные вопросы о нашем сервисе.
- **Помогать с проблемами:** Если у тебя возникли проблемы с использованием RUTUBE, бот поможет тебе их решить.
- **Обеспечивать быстрый ответ:** Бот работает круглосуточно, чтобы ответить на твои вопросы как можно быстрее.

👉 **Как пользоваться ботом?**
1. **Начни с команды /start**, чтобы запустить бота.
2. **Напиши свой вопрос**, и бот постарается ответить на него.
3. **Используй кнопки**, если тебе нужно выбрать один из вариантов ответа.

🤝 **Связь с нами:**
Если у тебя остались вопросы или ты хочешь связаться с нашей командой поддержки, просто напиши нам. Мы всегда готовы помочь!

👍 **Благодарим за выбор RUTUBE**
Мы рады, что ты с нами, и надеемся, что наш сервис будет полезен тебе.

"""

problem_answer = """Пожалуйста, опишите свою проблему как можно подробнее, чтобы мы могли Вам помочь.

Вы можете использовать голосовое сообщение, агент распознает текст и сможет ответить на ваше обращение."""

faq_answer = """Здесь Вы найдете ответы на часто задаваемые вопросы.
Если Вы не найдете ответ на свой вопрос, всегда можете обратиться к нам напрямую, нажав кнопку "Сообщить о проблеме"."""

problem_response_answer = (
    """Ваше обращение принято в нашу систему. В ближайшее время агент ответит Вам.

Среднее время ответа помощника ~ 1-2 минуты."""
)

back_start_answer = """Спасибо за обращение!"""

restart_problem_answer = """Попробуйте задать вопрос ещё раз!"""

did_not_understand_answer = (
    """Не понял о чем Вы сказали, пожалуйста, следуйте инструкциям!"""
)
